app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'admin@gmail.com'
 LIMIT 1
---
    public function login()
    {
        $model = new UserModel();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $model->where('username', $username)->first();