app/Controllers/Book.php

SELECT `buku`.*, `kategori`.`nama_kategori`, `peminjaman`.`status` as `status_pinjam`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id` = `buku`.`kategori_id`
LEFT JOIN `peminjaman` ON `peminjaman`.`book_id` = `buku`.`id` AND `peminjaman`.`status` = "dipinjam"
---
    public function index()
    {
        // Menggunakan JOIN ke tabel kategori DAN tabel peminjaman
        // Kita gunakan status='dipinjam' sebagai filter agar hanya buku yang sedang dipinjam yang terdeteksi
        $db = \Config\Database::connect();

        $data = $db->table('buku')
            ->select('buku.*, kategori.nama_kategori, peminjaman.status as status_pinjam')
            ->join('kategori', 'kategori.id = buku.kategori_id', 'left')
            ->join('peminjaman', 'peminjaman.book_id = buku.id AND peminjaman.status = "dipinjam"', 'left')
            ->get()
            ->getResultArray();