app/Controllers/Kategori.php

    public function index()
    {
        $model = new KategoriModel();
        return $this->respond($model->findAll());
---
SELECT *
FROM `kategori`