app/Controllers/Peminjaman.php

    public function all()
    {
        $db = \Config\Database::connect();
        // Melakukan JOIN ke tabel buku dan users agar admin bisa melihat detail lengkap
        $data = $db->table('peminjaman')
            ->select('peminjaman.*, buku.judul, users.username')
            ->join('buku', 'buku.id = peminjaman.book_id')
            ->join('users', 'users.id = peminjaman.user_id')
            ->orderBy('peminjaman.id', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `peminjaman`.*, `buku`.`judul`, `users`.`username`
FROM `peminjaman`
JOIN `buku` ON `buku`.`id` = `peminjaman`.`book_id`
JOIN `users` ON `users`.`id` = `peminjaman`.`user_id`
ORDER BY `peminjaman`.`id` DESC

    public function create()
    {
        $model = new PeminjamanModel();
        $data = $this->request->getJSON(true);

        // Validasi: Cek apakah buku sudah dipinjam
        $existing = $model->where('book_id', $data['book_id'])
                          ->where('status', 'dipinjam')
                          ->first();

        if ($existing) {
            return $this->fail('Buku ini sedang tidak tersedia (sudah dipinjam).', 400);
        }

        // Data peminjaman
        $data['tanggal_pinjam'] = date('Y-m-d');
        $data['status']         = 'dipinjam';

        if ($model->insert($data)) {
---
SELECT *
FROM `peminjaman`
WHERE `book_id` = '3'
AND `status` = 'dipinjam'
 LIMIT 1
INSERT INTO `peminjaman` (`book_id`, `user_id`, `tanggal_pinjam`, `status`) VALUES ('3', '3', '2026-06-11', 'dipinjam')

    public function returnBook($id = null)
    {
        $model = new PeminjamanModel();

        // Pastikan data peminjaman ada
        if (!$model->find($id)) {
            return $this->failNotFound('Data peminjaman tidak ditemukan');
        }

        // Update status menjadi 'dikembalikan'
        if ($model->update($id, ['status' => 'dikembalikan'])) {
---
SELECT *
FROM `peminjaman`
WHERE `peminjaman`.`id` = '4'
UPDATE `peminjaman` SET `status` = 'dikembalikan'
WHERE `peminjaman`.`id` IN ('4')

    public function userHistory($user_id = null)
    {
        $db = \Config\Database::connect();

        // Mengambil data peminjaman JOIN dengan buku untuk menampilkan judulnya
        $data = $db->table('peminjaman')
            ->select('peminjaman.*, buku.judul')
            ->join('buku', 'buku.id = peminjaman.book_id')
            ->where('peminjaman.user_id', $user_id)
            ->orderBy('peminjaman.id', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `peminjaman`.*, `buku`.`judul`
FROM `peminjaman`
JOIN `buku` ON `buku`.`id` = `peminjaman`.`book_id`
WHERE `peminjaman`.`user_id` = '1'
ORDER BY `peminjaman`.`id` DESC